app/Controllers/CategoriasController.php

SELECT *
FROM `categorias`
WHERE `activo` = 1
---
    public function index($activo = 1)
    {
        $categorias = $this->categorias->where('activo',$activo)->findALL();

SELECT *
FROM `categorias`
WHERE `activo` = 1
---
    public function eliminados($activo = 0)
    {
        $categorias = $this->categorias->where('activo',$activo)->findALL();