app/Controllers/ClientesController.php

    public function index($activo = 1)
    {
        $clientes = $this->clientes->where('activo',$activo)->findALL();
---
SELECT *
FROM `clientes`
WHERE `activo` = 1

    public function eliminados($activo = 0)
    {
        $clientes = $this->clientes->where('activo',$activo)->findALL();
---
SELECT *
FROM `clientes`
WHERE `activo` = 0

    public function reingresar($id)
    {
        $this->clientes->update($id,['activo' => 1]);
---
UPDATE `clientes` SET `activo` = 1, `fecha_update` = '2022-12-16 12:31:10'
WHERE `clientes`.`id` IN ('2')