app/Controllers/ProductosController.php

    public function index($activo = 1)
    {
        $productos = $this->productos->where('activo',$activo)->findALL();
---
SELECT *
FROM `productos`
WHERE `activo` = 1

    public function nuevo()
    {
        $categorias = $this->categorias->where('activo',1)->findALL();
---
SELECT *
FROM `categorias`
WHERE `activo` = 1

    public function insertar()
    {

        if($this->request->getMethod() == "post" && $this->validate($this->reglas))
        {
            $this->categorias->save([
                'codigo_producto' => $this->request->getPost('codigo_producto'),
                'nombre_producto' => $this->request->getPost('nombre_producto'),
                'detalle_producto' => $this->request->getPost('detalle_producto'),
                'precio_venta' => $this->request->getPost('precio_venta'),
                'precio_compra' => $this->request->getPost('precio_compra'),
                'stock_producto' => $this->request->getPost('stock_producto'),
                'stock_minimo' => $this->request->getPost('stock_minimo'),
                'id_categoria' => $this->request->getPost('id_categoria'),
            ]);
            return redirect()->to(base_url().'/productos');
        }
        else
        {
            $categorias = $this->categorias->where('activo',1)->findALL();
---
SELECT *
FROM `categorias`
WHERE `activo` = 1