app/Controllers/ProductosController.php

SELECT *
FROM `productos`
WHERE `activo` = 1
---
    public function index($activo = 1)
    {
        $productos = $this->productos->where('activo',$activo)->findALL();

SELECT *
FROM `categorias`
WHERE `activo` = 1
---
    public function nuevo()
    {
        $categorias = $this->categorias->where('activo',1)->findALL();

INSERT INTO `productos` (`codigo_producto`, `nombre_producto`, `detalle_producto`, `precio_venta`, `precio_compra`, `stock_producto`, `stock_minimo`, `id_categoria`, `fecha_creado`, `fecha_update`) VALUES ('002', 'mario', 'juego de n64', '55000', '40000', '15', '5', '22', '2022-12-15 21:18:07', '2022-12-15 21:18:07')
---
    public function insertar()
    {
        $this->productos->save([
            'codigo_producto' => $this->request->getPost('codigo_producto'),
            'nombre_producto' => $this->request->getPost('nombre_producto'),
            'detalle_producto' => $this->request->getPost('detalle_producto'),
            'precio_venta' => $this->request->getPost('precio_venta'),
            'precio_compra' => $this->request->getPost('precio_compra'),
            'stock_producto' => $this->request->getPost('stock_producto'),
        ]);